# Студент 1: Титович Є.А.

filename = "students_chain.txt"

try:
    with open(filename, 'w',encoding='utf-8') as f:
        f.write("Прізвище: Титович\n")

        f.write("Питання: Що таке списки (list) у Python, як створити список і додати елемент?\n")
        
        f.write("Інструкція: Запиши своє прізвище, дай відповідь на це питання кількома рядками, а також постав нове питання для наступного студента.\n")

        f.write("Прізвище: Лисаченко\n")
        f.write("Відповідь: Списки (list) у Python — це впорядковані змінювані (mutable) колекції об’єктів, які можуть містити елементи будь-якого типу.\n")
        f.write("Списки дозволяють зберігати, змінювати, додавати або видаляти елементи. Створюється він за допомгою квадратних дужок\n")
        f.wtire("Приклад списку: list = [1,2,3,4,5, ...]")
    print(f"Файл '{filename}' успішно створено.")

except IOError as e:w
    print(f"Помилка при створенні або записі у файл: {e}")
